game-bot/src/InformationRegisters/ТелеграмСостояние/ТелеграмСостояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмСостояние</name>
  <resources>
    <name>Профессия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВопросНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Чат</name>
    <type>
      <types>CatalogRef.ТелеграмЧаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

game-bot/src/InformationRegisters/ТелеграмСтатусЗадач/ТелеграмСтатусЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмСтатусЗадач</name>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ChatID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Чат</name>
    <type>
      <types>CatalogRef.ТелеграмЧаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Профессия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

game-bot/src/CommonModules/ТелеграмБот/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик элемента очереди в режиме работы бота - Эхо-бот
// 
// Параметры:
//  ДанныеЭлемента - Структура
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	Если НЕ ДанныеЭлемента.Свойство("message") Тогда
		Возврат;
	КонецЕсли;

	Сообщение = ДанныеЭлемента.message;

	Если НЕ Сообщение.Свойство("chat") Тогда
		Возврат;
	КонецЕсли;

	ChatID = Сообщение.chat.id;

	Текст = "";
	Если Сообщение.Свойство("text") Тогда
		Текст = Сообщение.text;
	КонецЕсли;

	Если Текст = "/start" Тогда

		СообщениеСтарт =
		"Привет! Мы — команда NextWW." + Символы.ПС +
		"Мы создали этот симулятор, потому что верим: чтобы найти свою профессию в IT, её нужно сначала почувствовать. Не через теорию, а через реальные практические задачи." + Символы.ПС +
		"Пока мы открыли путь в три ключевые и востребованные области: 1С-разработчик, разработчик игр на Unreal Engine и бэкенд-разработчик." + Символы.ПС +
		"Наша цель — помочь вам не просто выбрать, а примерить на себя роль специалиста. Узнать на собственном опыте, какая работа — с её типичными вызовами, логикой и драйвом — откликается именно вам." + Символы.ПС +
		"Принцип прост: «Попробуй, прежде чем решить». Погрузитесь в симуляцию, выполните задания и сделайте свой осознанный выбор. Давайте вместе найдем ваш путь.";

		Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		Доп.Клавиатура = КлавиатураСтартReply();

		ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, СообщениеСтарт, Доп);

		Возврат;

	КонецЕсли;
	
	Если Текст = "Начать" Тогда

		СообщениеСтарт =
		"Представьте, что вы получили высшее образование в каком-то модном техническом университете или просто прошли онлайн айти курсы. " +
		"И вот спустя сотни часов практики ваш первый рабочий день. Сейчас в команде есть ключевые роли, и ваша задача — выбрать, " +
		"в каком качестве вы в неё вольётесь. Вы можете стать 1С–разработчиком, разработчиком игр на Unreal Engine или бэкенд-разработчиком. " +
		"Кем вы придёте на свой первый рабочий день?";

		Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		Доп.Клавиатура = КлавиатураВыборПрофессииReply();

		ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, СообщениеСтарт, Доп);

		Возврат;

	КонецЕсли;
	
	Если Текст = "1С – разработчик" Тогда
	Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ОписаниеЧата = ДанныеЭлемента.message.chat;
	Чат = ИнтеграцияТелеграм.ПолучитьЧат(ОписаниеЧата);
	Доп.Клавиатура = Клавиатура1CReply();
	// УСТАНАВЛИВАЕМ СТАРТОВОЕ СОСТОЯНИЕ
	УстановитьСостояние(Чат, "1C", 0);

	ИнтеграцияТелеграм.ОтправитьСообщение(
		ChatID,
		"День начался не с будильника, а с адреналина в крови. В голове стучит: «Ты готов? Ты всё успел?». Первым делом — в почту. Да, они здесь: логины и пароли от HR. В рюкзаке — верный ноут, чистый блокнот для идей и стратегический запас печенек для расположения команды. Погнали.", Доп
	);

	Возврат;

	КонецЕсли;
	
	Если Текст = "Разработчик игр на Unreal Engine" Тогда
	Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ОписаниеЧата = ДанныеЭлемента.message.chat;
	Чат = ИнтеграцияТелеграм.ПолучитьЧат(ОписаниеЧата);
	// УСТАНАВЛИВАЕМ СТАРТОВОЕ СОСТОЯНИЕ
	УстановитьСостояние(Чат, "Unreal", 0);
	Доп.Клавиатура = КлавиатураЗаданийReply(3);
	ИнтеграцияТелеграм.ОтправитьСообщение(
		ChatID,
		"День начался не с будильника, а с адреналина в крови. В голове стучит: «Ты готов? Ты всё успел?». Первым делом — в почту. Да, они здесь: логины и пароли от HR. В рюкзаке — верный ноут, чистый блокнот для идей и стратегический запас печенек для расположения команды. Погнали.", Доп
	);

	Возврат;

	КонецЕсли;
	
	Если Текст = "Бэкенд-разработчик" Тогда
	Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ОписаниеЧата = ДанныеЭлемента.message.chat;
	Чат = ИнтеграцияТелеграм.ПолучитьЧат(ОписаниеЧата);
	Доп.Клавиатура = КлавиатураЗаданийReply(3);

	// УСТАНАВЛИВАЕМ СТАРТОВОЕ СОСТОЯНИЕ
	УстановитьСостояние(Чат, "Backend", 0);

	ИнтеграцияТелеграм.ОтправитьСообщение(
		ChatID,
		"День начался не с будильника, а с адреналина в крови. В голове стучит: «Ты готов? Ты всё успел?». Первым делом — в почту. Да, они здесь: логины и пароли от HR. В рюкзаке — верный ноут, чистый блокнот для идей и стратегический запас печенек для расположения команды. Погнали.", Доп
	);

	Возврат;

	КонецЕсли;
	
	Если Текст = "Приступить к работе" Тогда
	Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	Доп.Клавиатура = КлавиатураЗаданийReply(3);

	ВидеоДД = ИнтеграцияТелеграм.ПрочитатьВидеоВДвоичныеДанные("C:\Video\intro.mp4");
	ИнтеграцияТелеграм.ОтправитьВидео(ChatID, ВидеоДД, "", Доп);

	Возврат;

	КонецЕсли;
	
	Если Лев(Текст, 7) = "Задание" Тогда

    НомерЗадания = 0;
    Попытка
        НомерЗадания = Число(СокрЛП(Сред(Текст, 8)));
    Исключение
        НомерЗадания = 0;
    КонецПопытки;

    Если НомерЗадания = 0 Тогда
        ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, "Не понял номер задания.");
        Возврат;
    КонецЕсли;

    ОписаниеЧата = ДанныеЭлемента.message.chat;
    Чат = ИнтеграцияТелеграм.ПолучитьЧат(ОписаниеЧата);

    Сост = ПолучитьСостояние(Чат);

    // 1. СНАЧАЛА проверяем профессию
    Если ПустаяСтрока(Сост.Профессия) Тогда
        ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, "Сначала выберите профессию.");
        Возврат;
    КонецЕсли;

    // 2. ПОТОМ проверяем, отвечено ли задание
    Если ЗаданиеУжеОтвечено(Чат, ChatID, Сост.Профессия, НомерЗадания) Тогда
        Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
        Доп.Клавиатура = КлавиатураЗаданийReply(КоличествоЗаданийДляПрофессии(Сост.Профессия));
        ИнтеграцияТелеграм.ОтправитьСообщение(
            ChatID,
            "Это задание уже отвечено. Выберите другое.",
            Доп
        );
        Возврат;
    КонецЕсли;

    // 3. ТОЛЬКО ТЕПЕРЬ фиксируем текущее задание
    УстановитьСостояние(Чат, Сост.Профессия, НомерЗадания);

    // 4. Отправляем вопрос
    Вопрос = ПолучитьВопрос(Сост.Профессия, НомерЗадания);

    Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
    Доп.Клавиатура = КлавиатураОтветы1_4Reply();

    ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, Вопрос, Доп);
    Возврат;

	КонецЕсли;
	
	Если Текст = "1" ИЛИ Текст = "2" ИЛИ Текст = "3" ИЛИ Текст = "4" Тогда

    ОписаниеЧата = ДанныеЭлемента.message.chat;
    Чат = ИнтеграцияТелеграм.ПолучитьЧат(ОписаниеЧата);

    Сост = ПолучитьСостояние(Чат);

    Если Сост.ВопросНомер = 0 Тогда
        ИнтеграцияТелеграм.ОтправитьСообщение(ОписаниеЧата.id, "Сначала выберите профессию и задание.");
        Возврат;
    КонецЕсли;

    НомерЗадания = Сост.ВопросНомер;
    Профессия = Сост.Профессия;

    // 1) Проверка "уже отвечено" — ДОБАВЬ ChatID
    Если ЗаданиеУжеОтвечено(Чат, ChatID, Профессия, НомерЗадания) Тогда
        Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
        Доп.Клавиатура = КлавиатураЗаданийReply(3);
        ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, "Ответ уже принят ранее. Выберите другое задание.", Доп);
        Возврат;
    КонецЕсли;

    ПравильныйВариант = ПолучитьПравильныйВариант(Профессия, НомерЗадания);
	Статус = 0;
    Если Число(Текст) = ПравильныйВариант Тогда
        Заголовок = "✅ Верно.";
        Статус = 1;
    Иначе
        Заголовок = "❌ Неверно.";
        Статус = 2;
    КонецЕсли;

// если дошли сюда — ответ впервые записан
	Объяснение = ПолучитьОбъяснение(Профессия, НомерЗадания);
	ТекстОтвета = Заголовок + Символы.ПС + Символы.ПС + Объяснение;
	
	Доп = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	Доп.Клавиатура = КлавиатураЗаданийReply(КоличествоЗаданийДляПрофессии(Профессия));
	ИнтеграцияТелеграм.ОтправитьСообщение(ChatID, ТекстОтвета, Доп);
	Возврат;

	КонецЕсли;
	
КонецПроцедуры

Функция КлавиатураВыборПрофессииReply() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "1С – разработчик"));

	Ряд2 = Новый Массив;
	Ряд2.Добавить(Новый Структура("text", "Разработчик игр на Unreal Engine"));

	Ряд3 = Новый Массив;
	Ряд3.Добавить(Новый Структура("text", "Бэкенд-разработчик"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);
	Строки.Добавить(Ряд2);
	Строки.Добавить(Ряд3);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции


Функция КлавиатураСтартReply() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "Начать"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции

Функция Клавиатура1CReply() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "Приступить к работе"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции

Функция КлавиатураUnrealEngineReply() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "Продолжить работу"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции

Функция КлавиатураBackendReply() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "Продолжить"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции

Функция КлавиатураПомочьБухгалтеруReply() Экспорт
	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "1"));
	Ряд1.Добавить(Новый Структура("text", "2"));
	Ряд1.Добавить(Новый Структура("text", "3"));
	Ряд1.Добавить(Новый Структура("text", "4"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции
Процедура УстановитьСостояние(Чат, Профессия, ВопросНомер) Экспорт

	Набор = РегистрыСведений.ТелеграмСостояние.СоздатьНаборЗаписей();
	Набор.Отбор.Чат.Установить(Чат);

	Набор.Прочитать();

	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.Чат = Чат;
	Иначе
		Запись = Набор[0];
	КонецЕсли;

	Запись.Профессия = Профессия;
	Запись.ВопросНомер = ВопросНомер;

	Набор.Записать();

КонецПроцедуры

Функция ПолучитьСостояние(Чат) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сост.Профессия КАК Профессия,
	|	Сост.ВопросНомер КАК ВопросНомер
	|ИЗ
	|	РегистрСведений.ТелеграмСостояние КАК Сост
	|ГДЕ
	|	Сост.Чат = &Чат");
	Запрос.УстановитьПараметр("Чат", Чат);

	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Новый Структура("Профессия,ВопросНомер", Выб.Профессия, Выб.ВопросНомер);
	КонецЕсли;

	Возврат Новый Структура("Профессия,ВопросНомер", "", 0);
КонецФункции

Функция ПолучитьПравильныйВариант(Профессия, НомерВопроса) Экспорт

	// По умолчанию — неверный номер
	ПравильныйВариант = 0;

	Если Профессия = "1C" Тогда
		
		Если НомерВопроса = 1 Тогда
			ПравильныйВариант = 3;
		ИначеЕсли НомерВопроса = 2 Тогда
			ПравильныйВариант = 2;
		ИначеЕсли НомерВопроса = 3 Тогда
			ПравильныйВариант = 2;
		КонецЕсли;

	ИначеЕсли Профессия = "Unreal" Тогда
		
		Если НомерВопроса = 1 Тогда
			ПравильныйВариант = 2;
		ИначеЕсли НомерВопроса = 2 Тогда
			ПравильныйВариант = 2;
		ИначеЕсли НомерВопроса = 3 Тогда
			ПравильныйВариант = 2;
		КонецЕсли;

	ИначеЕсли Профессия = "Backend" Тогда
		
		Если НомерВопроса = 1 Тогда
			ПравильныйВариант = 2;
		ИначеЕсли НомерВопроса = 2 Тогда
			ПравильныйВариант = 2;
		ИначеЕсли НомерВопроса = 3 Тогда
			ПравильныйВариант = 2;
		КонецЕсли;

	КонецЕсли;

	Возврат ПравильныйВариант;

КонецФункции

Процедура УстановитьСтатусЗадания(Чат, ChatID, Профессия, НомерЗадания, Статус) Экспорт

    Набор = РегистрыСведений.ТелеграмСтатусЗадач.СоздатьНаборЗаписей();

    Набор.Отбор.Чат.Установить(Чат);
    Набор.Отбор.ChatID.Установить(ChatID);
    Набор.Отбор.Профессия.Установить(Профессия);
    Набор.Отбор.НомерЗадания.Установить(НомерЗадания);

    Набор.Прочитать();

    Если Набор.Количество() = 0 Тогда
        Запись = Набор.Добавить();
        Запись.Чат = Чат;
        Запись.ChatID = ChatID;
        Запись.Профессия = Профессия;
        Запись.НомерЗадания = НомерЗадания;
    Иначе
        Запись = Набор[0];
    КонецЕсли;

    Запись.Статус = Статус;
    Набор.Записать();

КонецПроцедуры

Функция ПолучитьСтатусЗадания(Чат, ChatID, Профессия, НомерЗадания) Экспорт

    Запрос = Новый Запрос(
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   Ст.Статус КАК Статус
    |ИЗ
    |   РегистрСведений.ТелеграмСтатусЗадач КАК Ст
    |ГДЕ
    |   Ст.Чат = &Чат
    |   И Ст.ChatID = &ChatID
    |   И Ст.Профессия = &Профессия
    |   И Ст.НомерЗадания = &НомерЗадания");

    Запрос.УстановитьПараметр("Чат", Чат);
    Запрос.УстановитьПараметр("ChatID", ChatID);
    Запрос.УстановитьПараметр("Профессия", Профессия);
    Запрос.УстановитьПараметр("НомерЗадания", НомерЗадания);

    Выб = Запрос.Выполнить().Выбрать();
    Если Выб.Следующий() Тогда
        Возврат Выб.Статус;
    КонецЕсли;

    Возврат 0;

КонецФункции

Функция ЗаданиеУжеОтвечено(Чат, ChatID, Профессия, НомерЗадания) Экспорт
    Возврат ПолучитьСтатусЗадания(Чат, ChatID, Профессия, НомерЗадания) <> 0;
КонецФункции

Функция КлавиатураЗаданийReply(КоличествоЗаданий) Экспорт

	Строки = Новый Массив;

	Для Номер = 1 По КоличествоЗаданий Цикл
		Ряд = Новый Массив;
		Ряд.Добавить(Новый Структура("text", "Задание " + Строка(Номер)));
		Строки.Добавить(Ряд);
	КонецЦикла;

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции

Функция КлавиатураОтветы1_4Reply() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text", "1"));
	Ряд1.Добавить(Новый Структура("text", "2"));
	Ряд1.Добавить(Новый Структура("text", "3"));
	Ряд1.Добавить(Новый Структура("text", "4"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);

	Клавиатура = Новый Структура;
	Клавиатура.Вставить("keyboard", Строки);
	Клавиатура.Вставить("resize_keyboard", Истина);
	Клавиатура.Вставить("one_time_keyboard", Ложь);

	Возврат Клавиатура;

КонецФункции

Функция ПолучитьВопрос(Профессия, НомерЗадания) Экспорт

	Если Профессия = "1C" Тогда

		Если НомерЗадания = 1 Тогда
			Возврат "Ситуация: Бухгалтер Люда говорит: «У меня в 1С новый товар не добавляется! Пишет какую-то ошибку про «обязательное поле», но все поля я вроде заполнила». Ты подходишь и видите, что она заполнила название, цену и единицу измерения. Что можешь ей предложить?" + Символы.ПС +
				"1.	Сохранить товар без этого поля, ведь программа иногда ошибается." + Символы.ПС +
				"2.	Пойти в настройки справочника и временно убрать обязательность всех полей." + Символы.ПС +
				"3.	Внимательно посмотреть на форму добавления — возможно, в самом низу или в отдельной вкладке есть не заполненное поле, например, «Артикул» или «Вид номенклатуры»." + Символы.ПС +
				"4.	Создать товар через конфигуратор, это надежнее.";
		ИначеЕсли НомерЗадания = 2 Тогда
			Возврат "Запрос от менеджера: «Хочу, чтобы в списке клиентов те, с кем мы давно не работали, как-то выделялись. Можно их сделать серым цветом?» Какой самый правильный с точки зрения поддержки способ реализовать это?" + Символы.ПС + 
			"1.	Вручную перекрашивать строки раз в неделю." + Символы.ПС + 
			"2.	Узнать у менеджера точное правило (например, «нет продаж более 6 месяцев») и добавить это условие через механизм «Условное оформление» в списке." + Символы.ПС + 
			"3.	Скачать специальную программу для раскраски таблиц." + Символы.ПС + 
			"4.	Написать обработку, которая будет менять цвет шрифта прямо в данных справочника.";
		ИначеЕсли НомерЗадания = 3 Тогда
			Возврат "Ситуация: Важный финансовый документ «не проводится» и его нельзя изменить. В истории видно, что с ним работал уволившийся на прошлой неделе сотрудник. Что логичнее всего сделать?" + Символы.ПС + 
			"1.	Удалить документ и создать заново, потеряв все данные." + Символы.ПС + 
			"2.	Уточнить у администратора базы, можно ли снять блокировку документа для этого пользователя через мониторинг сеансов или служебные функции." + Символы.ПС + 
			"3.	Попросить всех в офисе выйти из 1С, может, тогда разблокируется." + Символы.ПС + 
			"4.	Написать скрипт, который напрямую в базе данных изменит статус документа.";
		КонецЕсли;

	ИначеЕсли Профессия = "Unreal" Тогда

		Если НомерЗадания = 1 Тогда
			Возврат "Ситуация: Тестировщик пишет: «Персонаж проваливается сквозь пол в третьем уровне, когда прыгает с определённой платформы». Твой первый шаг?" + Символы.ПС + 
			"1.	Перезапустить редактор Unreal Engine." + Символы.ПС + 
			"2.	Открыть этот уровень в редакторе, найти ту самую платформу и проверить, назначен ли ей корректный Collision Mesh (коллизия)." + Символы.ПС + 
			"3.	Увеличить гравитацию для персонажа во всём проекте." + Символы.ПС + 
			"4.	Сказать, что это фича — «режим призрака».";
		ИначеЕсли НомерЗадания = 2 Тогда
			Возврат "Запрос от геймдизайнера: «Нужно, чтобы при подборе аптечки персонаж восстанавливал 25 здоровья, и чтобы над ним всплывала зелёная цифра +25». Какой инструмент Unreal Engine логичнее использовать для прототипа этой механики?" + Символы.ПС + 
			"1.	Писать с нулу С++ класс для аптечки." + Символы.ПС + 
			"2.	Использовать Blueprint (Визуальное скриптование) — создать простую логику столкновения и спауна виджета с текстом." + Символы.ПС + 
			"3.	Искать готовую аптечку в маркетплейсе Unity Asset Store." + Символы.ПС + 
			"4.	Нарисовать цифру в Photoshop и вручную добавлять её на все кадры анимации.";
		ИначеЕсли НомерЗадания = 3 Тогда
			Возврат "Ситуация: На сложном уровне частота кадров (FPS) падает. В инструменте Stat Unit видно, что самое большое время занимает Draw Calls (вызовы отрисовки). Какое самое простое действие может помочь?" + Символы.ПС + 
			"1.	Увеличить разрешение текстур в два раза." + Символы.ПС + 
			"2.	Проверить, не забыл ли ты включить Batch Drawing или использовать Instanced Static Meshes для одинаковых объектов (деревьев, камней)." + Символы.ПС + 
			"3.	Добавить больше точечных источников света (Point Lights) для красоты." + Символы.ПС + 
			"4.	Посоветовать игрокам купить видеокарты мощнее.";
		КонецЕсли;

	ИначеЕсли Профессия = "Backend" Тогда

		Если НомерЗадания = 1 Тогда
			Возврат "Ситуация: Пользователи мобильного приложения жалуются, что не могут зарегистрироваться. При отправке номера телефона виснет отправка.... С чего начинаешь расследование?" + Символы.ПС + 
			"1.	Посоветовать пользователям переустановить приложение." + Символы.ПС + 
			"2.	Проверить статус и логи сервера, который отвечает за отправку SMS-кода. Возможно, он лежит или закончились кредиты у SMS-шлюза." + Символы.ПС + 
			"3.	Перезапустить фронтенд-сервер, на котором работает сайт компании." + Символы.ПС + 
			"4.	Написать в поддержку SMS-сервиса, что они вообще работают.";
		ИначеЕсли НомерЗадания = 2 Тогда
			Возврат "Запрос от аналитика: В отчете за вчерашний день странная цифра: количество новых заказов в 10 раз меньше обычного. Данные точно верные? Твой алгоритм проверки:" + Символы.ПС + 
			"1.	Сказать аналитику, чтобы он проверил свои Excel-формулы." + Символы.ПС + 
			"2.	Сделать прямой запрос к базе данных за этот период и сравнить число с тем, что видит аналитик в своём BI-инструменте." + Символы.ПС + 
			"3.	Обновить все данные в базе на случайные." + Символы.ПС + 
			"4.	Закрыть задачу, так как это проблема фронтенда, а не бэкенда.";
		ИначеЕсли НомерЗадания = 3 Тогда
			Возврат "Ситуация: В мониторинге видишь, что эндпоинт GET /api/products стал отвечать очень медленно, особенно при запросе каталога из 1000 товаров. Какое самое вероятное простое решение?" + Символы.ПС + 
			"1.	Купить сервер мощнее." + Символы.ПС + 
			"2.	Добавить к этому запросу индексы в базе данных на часто используемые поля (например, category_id, is_active) и проверить, не выбираются ли все столбцы таблицы (SELECT *), а только нужные." + Символы.ПС + 
			"3.	Увеличить таймаут на фронтенде, чтобы пользователи подождали." + Символы.ПС + 
			"4.	Удалить половину товаров из базы.";
		КонецЕсли;

	КонецЕсли;

	Возврат "Такого задания нет.";

КонецФункции

Функция ПолучитьОбъяснение(Профессия, НомерЗадания) Экспорт

	Если Профессия = "1C" Тогда
		
		Если НомерЗадания = 1 Тогда
			Возврат
			"Часто проблема не в коде, а в интерфейсе. Пользователь может не видеть всех обязательных полей, если они скрыты во вкладках или внизу формы, куда нужно прокрутить. Хороший разработчик сначала смотрит глазами пользователя.";
		КонецЕсли;
		
		Если НомерЗадания = 2 Тогда
			Возврат
			"Правильный подход — не делать разовое действие, а настроить правило. «Условное оформление» — это штатный инструмент 1С, который будет автоматически применять цвет по заданному условию. Это и есть работа разработчика: автоматизировать рутину.";
		КонецЕсли;
		
		Если НомерЗадания = 3 Тогда
			Возврат
			"В 1С есть механизм блокировок данных. Если сеанс пользователя завершился некорректно, объект может остаться заблокированным. Решение — не ломать данные, а использовать административные инструменты для снятия блокировки. Это показывает понимание работы платформы.";
		КонецЕсли;

	КонецЕсли;
	
	Если Профессия = "Unreal" Тогда
		
		Если НомерЗадания = 1 Тогда
			Возврат
			"Почему это важно: Чаще всего такие баги возникают из-за проблем с коллизией (столкновением). Разработчик должен уметь проверять базовые свойства объектов в редакторе. Это рутинная, но ключевая задача геймдев-инженера.";
		КонецЕсли;
		
		Если НомерЗадания = 2 Тогда
			Возврат
			"Почему это важно: Blueprint — это «лицо» Unreal Engine. Это мощный инструмент для быстрого прототипирования игровой логики без глубокого программирования. Понимание, когда использовать Blueprint, а когда C++, — основа workflow.";
		КонецЕсли;
		
		Если НомерЗадания = 3 Тогда
			Возврат
			"Почему это важно: Оптимизация рендеринга — постоянная задача. Знание базовых принципов, как снизить нагрузку (объединение объектов, инстансинг), критически важно даже для джуна. Это не «магия», а ремесло.";
		КонецЕсли;

	КонецЕсли;
	
	Если Профессия = "Backend" Тогда
		
		Если НомерЗадания = 1 Тогда
			Возврат
			"Почему это важно: Бэкенд-разработчик — первый, кого спрашивают, когда что-то не работает. Его первый инструмент — логи и мониторинг. Нужно уметь быстро определить, в каком из множества сервисов (в данном случае — в микросервисе аутентификации) проблема.";
		КонецЕсли;
		
		Если НомерЗадания = 2 Тогда
			Возврат
			"Почему это важно: Бэкенд-разработчик — хранитель и источник истины в данных. Его код пишет данные в БД, и он должен уметь поговорить с базой на языке SQL, чтобы проверить целостность и корректность информации. Это ежедневная рутина.";
		КонецЕсли;
		
		Если НомерЗадания = 3 Тогда
			Возврат
			"Почему это важно: 80% проблем с производительностью бэкенда — это оптимизация запросов к базе данных. Умение читать EXPLAIN-запрос, понимать, что такое N+1 проблема, и знать, когда добавить индекс — один из ключевых навыков.";
		КонецЕсли;

	КонецЕсли;

	// Заглушка на будущее
	Возврат
	"Важно не искать быстрый обход, а понять причину проблемы и выбрать решение, " +
	"которое не сломает систему и не создаст новых ошибок.";

КонецФункции

Функция КоличествоЗаданийДляПрофессии(Профессия) Экспорт
	Если Профессия = "1C" Тогда
		Возврат 3;
	ИначеЕсли Профессия = "Unreal" Тогда
		Возврат 3;
	ИначеЕсли Профессия = "Backend" Тогда
		Возврат 3;
	КонецЕсли;

	Возврат 0;
КонецФункции


Функция ИтогПоПрофессии(Чат, ChatID, Профессия) Экспорт

    КолЗаданий = КоличествоЗаданийДляПрофессии(Профессия);

    Запрос = Новый Запрос(
    "ВЫБРАТЬ
    |   Ст.НомерЗадания,
    |   Ст.Статус
    |ИЗ
    |   РегистрСведений.ТелеграмСтатусЗадач КАК Ст
    |ГДЕ
    |   Ст.Чат = &Чат
    |   И Ст.ChatID = &ChatID
    |   И Ст.Профессия = &Профессия");

    Запрос.УстановитьПараметр("Чат", Чат);
    Запрос.УстановитьПараметр("ChatID", ChatID);
    Запрос.УстановитьПараметр("Профессия", Профессия);

    Статусы = Новый Соответствие;
    Выб = Запрос.Выполнить().Выбрать();
    Пока Выб.Следующий() Цикл
        Статусы.Вставить(Выб.НомерЗадания, Выб.Статус);
    КонецЦикла;

    ВсеОтвечены = Истина;
    ЕстьОшибки = Ложь;

    Для Номер = 1 По КолЗаданий Цикл
        Если НЕ Статусы.СодержитКлюч(Номер) Тогда
            ВсеОтвечены = Ложь;
            Прервать;
        КонецЕсли;

        Если Статусы[Номер] = 2 Тогда
            ЕстьОшибки = Истина;
        КонецЕсли;
    КонецЦикла;

    Возврат Новый Структура("ВсеОтвечены,ЕстьОшибки", ВсеОтвечены, ЕстьОшибки);

КонецФункции

Процедура ОтправитьИтоговоеВидео(ChatID, ЕстьОшибки) Экспорт

	Если ЕстьОшибки Тогда
		Путь = "C:\Video\bad.mov";
	Иначе
		Путь = "C:\Video\nice.mov";
	КонецЕсли;

	ВидеоДД = ИнтеграцияТелеграм.ПрочитатьВидеоВДвоичныеДанные(Путь);
	ИнтеграцияТелеграм.ОтправитьВидео(ChatID, ВидеоДД, "");

КонецПроцедуры

Процедура СброситьСостояниеПолностью(Чат) Экспорт
	Набор = РегистрыСведений.ТелеграмСостояние.СоздатьНаборЗаписей();
	Набор.Отбор.Чат.Установить(Чат);
	Набор.Прочитать();

	Если Набор.Количество() > 0 Тогда
		Запись = Набор[0];
		Запись.Профессия = "";
		Запись.ВопросНомер = 0;
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СброситьСтатусыЗадач(Чат, ChatID, Профессия) Экспорт

    Набор = РегистрыСведений.ТелеграмСтатусЗадач.СоздатьНаборЗаписей();
    Набор.Отбор.Чат.Установить(Чат);
    Набор.Отбор.ChatID.Установить(ChatID);
    Набор.Отбор.Профессия.Установить(Профессия);

    Набор.Прочитать();
    Пока Набор.Количество() > 0 Цикл
        Набор.Удалить(0);
    КонецЦикла;

    Набор.Записать();

КонецПроцедуры

Процедура СброситьВсёПослеРезультата(Чат, ChatID, Профессия) Экспорт

	СброситьСостояниеПолностью(Чат);
	СброситьСтатусыЗадач(Чат, ChatID, Профессия);

КонецПроцедуры


#КонецОбласти
